trade_exp/src/Catalogs/оп_ПоказателиРасчета/оп_ПоказателиРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0443114b-5a2e-443f-be21-697ec08e56a8">
  <name>оп_ПоказателиРасчета</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="82085efb-a6bd-45b9-945a-3a5f03891afb">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dba7dd91-f80f-4483-9ce7-2b0e256605f4">
    <name>СпособФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ce03f07-24ca-46a7-bd20-0429d60203bb">
    <name>ЗначениеПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="075c7846-7cae-4ee1-bb71-5170549fec21">
    <name>НезависимоОтОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c97d06-363a-4c5a-8f81-3e4e7fe6c599">
    <name>ОчищатьПоказатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a4b5872-1996-499d-ba63-d8eacdac7607">
    <name>ИспользоватьХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21fde61b-3675-4728-b2ea-7c5bfcb545e5">
    <name>ИспользоватьСклады</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f17498c-202d-4419-b8e4-17e4ab3b344b">
    <name>ИспользоватьДату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4a35e70-7f30-4b76-83e4-581345babb6c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e9b0fc6-9c1a-490d-b1dd-a52d58fb92f5">
    <name>ИспользоватьРегламентноеЗадание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/оп_РезультатРасчетаПоказателей/оп_РезультатРасчетаПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>оп_РезультатРасчетаПоказателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="0ecb9167-823e-4f24-9f03-182411741ef6">
    <name>РезультатЧисло</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="85a64d22-d699-44a2-9cd4-a8f913f7298c">
    <name>ДатаРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7e67949c-7eff-4ac7-ad06-97dde8d9947e">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="775bb22f-9cd8-41c2-b84f-0317758658bb">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dbdd00e8-1bdb-449a-aa82-ac74b4a6ee63">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="512be237-9443-42aa-8d41-aa7a43c55ad1">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c161122b-e9e4-4968-b28b-cca8c4061310">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1dc3ccb8-3ded-4011-9709-7c20a1b592a9">
    <name>ДопПараметрДата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварныеОграничения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>НормаПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>УпаковкаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СреднедневноеПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СреднееОтклонениеПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СтраховоеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>АлгоритмРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="79e85354-95b1-4fa4-912d-e98823eec07c">
    <name>ПределМИН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="33ce8317-c35e-4bb4-9e22-34e5046989ad">
    <name>ПределМАКС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЕстьРекомендацияПоИзменению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоГруппировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРасчетаРекомендаций</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЭтоДействующийПараметр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="78280a32-83cd-4d53-9f8a-a6d612ce998a">
    <name>ГруппировкаТоварныхОграничений</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СпособыМетодыОбеспечения/СпособыМетодыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7613e09a-0570-4383-beea-753740d01cba">
  <name>СпособыМетодыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="2b365089-31eb-47a5-a4db-e10ecc9b38c3">
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44b20b09-231f-4fb1-bbcb-abd7573c8005">
    <name>АлгоритмРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ad40394f-e977-4c3f-9a8e-21285705eca4">
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2ab82e65-edbd-44c9-b8c4-06698df3ba5f">
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b5b7cf79-2605-4697-a09b-6f06fe782168">
    <name>УпаковкаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="94f41d96-826c-4638-a399-afdc35a3ec43">
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="6804ca88-3b4b-4c33-9bde-a740a3da558b">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00273654-e2db-4e02-baec-03befe482a40">
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="c310b86b-e983-44f5-898c-8f454e861f73">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a9ad9568-3e89-4a53-84a5-ad1a4430779e">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="91f30faf-0bf8-4f26-91c9-0d1d49df06d0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9c288854-3c9d-4fcd-aa23-0fee55b6cbf9">
    <name>ТипОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/оп_АлгоритмыОбеспеченияПотребностей/оп_АлгоритмыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1656f9e3-402b-4cda-8c05-cade8211f967">
  <name>оп_АлгоритмыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1df4ad7a-ef23-4439-9a3c-e19877f53323">
    <name>ВидФормулыМакс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cbb02b65-7818-4603-ac86-4e4fb29886f6">
    <name>СпособФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a69d3f59-a567-4dff-875e-04da7319cf10">
    <name>ФормулаМакс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d227b77-055f-43dc-ad16-c29e32cd5d6b">
    <name>ВидФормулыМин</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7f8606e-fb92-4ecb-adfe-e2ef34fd8c2c">
    <name>ФормулаМин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="030c2534-28d6-4a95-8cf1-ae42be34fe75">
    <name>ТекстЗапроса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="848ebe9f-31e9-45d2-b73f-699924c76d6b">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4bf50ee7-8131-4dd1-b22e-98c4ffbd5833">
    <name>Показатели</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="41100ca9-54a9-40dc-92a3-10b4fb41b21b">
      <name>Показатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/оп_ПоказателиРасчета/ManagerModule.bsl
// Осуществляет формирование новой СКД.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных - Схема компоновки данных.
//
Функция СформироватьНовуюСхемуКомпоновкиДанных(ПараметрыПолей) Экспорт
	
	СКД                         = Новый СхемаКомпоновкиДанных;
	Источник                    = СКД.ИсточникиДанных.Добавить();
	Источник.Имя                = "ИсточникДанныхПоказатели";
	Источник.ТипИсточникаДанных = "Local";
	НаборДанных                 = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя             = "ДанныеПоказателя";
	НаборДанных.Запрос          =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,";
		
	Если ПараметрыПолей.ИспользоватьХарактеристики Тогда
		НаборДанных.Запрос = НаборДанных.Запрос + "
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,";
	КонецЕсли;
	Если ПараметрыПолей.ИспользоватьСклады Тогда
		НаборДанных.Запрос = НаборДанных.Запрос + "
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад,";
	КонецЕсли;
	Если ПараметрыПолей.ИспользоватьДату Тогда
		НаборДанных.Запрос = НаборДанных.Запрос + "
		|	датавремя(1,1,1) КАК ДопПараметрДата,";
	КонецЕсли;
	
	
	НаборДанных.Запрос = НаборДанных.Запрос + "
		|	0 КАК РезультатЧисло
		|{ВЫБРАТЬ
		|	Номенклатура.*,";
		
	Если ПараметрыПолей.ИспользоватьХарактеристики Тогда
		НаборДанных.Запрос = НаборДанных.Запрос + "
			|	Характеристика.*,";
		КонецЕсли;
	Если ПараметрыПолей.ИспользоватьСклады Тогда
		НаборДанных.Запрос = НаборДанных.Запрос + "
			|	Склад.*,";
	КонецЕсли;
	Если ПараметрыПолей.ИспользоватьДату Тогда
		НаборДанных.Запрос = НаборДанных.Запрос + "
			|	ДопПараметрДата.*,";
	КонецЕсли;
		
	НаборДанных.Запрос = НаборДанных.Запрос + "
		|	РезультатЧисло}";
	
		
	НаборДанных.ИсточникДанных = "ИсточникДанныхПоказатели";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Ложь;
	
	ОбязательныеПоля = ПолучитьОбязательныеПоляСхемыКомпоновкиДанных(ПараметрыПолей);
	
	Для Каждого ОбязательноеПоле Из ОбязательныеПоля Цикл
		
		НовоеПоле             = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле        = ОбязательноеПоле.Ключ;
		НовоеПоле.ПутьКДанным = ОбязательноеПоле.Ключ;
		НовоеПоле.ТипЗначения = ОбязательноеПоле.Значение;
		
	КонецЦикла;
	
	Возврат СКД;

КонецФункции
// Возвращает структуру с синонимом и схемой компоновки
// данных по имени макета
//
// Параметры:
//	Ссылка - СправочникСсылка.ВидыЦены - ссылка на вид цены
//	ИмяМакета - Строка - имя макета, из которого необходимо получить описание и схему
//
// Возвращаемое значение:
//	Структура - описание и схема компоновки данных
//
Функция ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(Ссылка, ИмяМакета = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Описание",                  "");
	ВозвращаемоеЗначение.Вставить("СхемаКомпоновкиДанных",     Неопределено);
	ВозвращаемоеЗначение.Вставить("НастройкиКомпоновкиДанных", Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	оп_ПоказателиРасчета.ХранилищеСхемыКомпоновкиДанных КАК ХранилищеСхемыКомпоновкиДанных,
	|	оп_ПоказателиРасчета.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроекКомпоновкиДанных
	|ИЗ
	|	Справочник.оп_ПоказателиРасчета КАК оп_ПоказателиРасчета
	|ГДЕ
	|	оп_ПоказателиРасчета.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ПараметрыПолей=новый Структура("ИспользоватьХарактеристики,ИспользоватьСклады,ИспользоватьДату",ссылка.ИспользоватьХарактеристики,ссылка.ИспользоватьСклады,ссылка.ИспользоватьДату);
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		
		ВозвращаемоеЗначение.Описание = ИмяМакета;
		Если Выборка.Следующий() Тогда
			
			СхемаКомпоновкиДанных = Выборка.ХранилищеСхемыКомпоновкиДанных.Получить();
			Если СхемаКомпоновкиДанных = Неопределено Тогда
				ВозвращаемоеЗначение.СхемаКомпоновкиДанных = СформироватьНовуюСхемуКомпоновкиДанных(ПараметрыПолей);
				ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = Неопределено;
			Иначе
				ВозвращаемоеЗначение.СхемаКомпоновкиДанных = СхемаКомпоновкиДанных;
				ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = Выборка.ХранилищеНастроекКомпоновкиДанных.Получить();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.Описание = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).Макеты.Найти(ИмяМакета).Синоним;
		ВозвращаемоеЗначение.СхемаКомпоновкиДанных = Справочники.оп_ПоказателиРасчета.ПолучитьМакет(ИмяМакета);
		Если Выборка.Следующий() Тогда
			ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = Выборка.ХранилищеНастроекКомпоновкиДанных.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
// Возвращает имена и типы полей, которые должны обязательно присутствовать.
// в СКД, используемой для заполнения цен по данным ИБ.
//
// Возвращаемое значение:
//	 Соответствие - В ключах содержатся имена полей. В значениях - типы полей.
//
Функция ПолучитьОбязательныеПоляСхемыКомпоновкиДанных(ПараметрыПолей) Экспорт
	
	Поля = Новый Соответствие;
	
	Поля.Вставить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Если ПараметрыПолей.ИспользоватьХарактеристики Тогда
		Поля.Вставить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КонецЕсли;
	
	Если ПараметрыПолей.ИспользоватьСклады Тогда
		Поля.Вставить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	КонецЕсли;
	Если ПараметрыПолей.использоватьДату Тогда
		Поля.Вставить("ДопПараметрДата", Новый ОписаниеТипов("Дата"));
	КонецЕсли;
	
	Поля.Вставить("РезультатЧисло",   Новый ОписаниеТипов("Число"));
	
	Возврат Поля;
	
КонецФункции
// Проверяет схему компоновки данных на соответствие ограничениям, необходимым
// для ее использования при расчете цен.
//
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, которую необходимо проверить.
//  СообщениеОбОшибке     - Строка - содержит вводную часть сообщения об ошибке.
//
// Возвращаемое значение:
//  Булево - Истина, если проверка пройдена успешно.
//
Функция ПроверитьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных,параметрыПолей, СообщениеОбОшибке = Неопределено) Экспорт
	
	Поля = ПолучитьОбязательныеПоляСхемыКомпоновкиДанных(параметрыПолей);
	
	Возврат ПроверитьСхемуКомпоновкиДанныхПоОбязательнымПолям(СхемаКомпоновкиДанных, Поля, СообщениеОбОшибке);
	
КонецФункции
// Проверяет схему компоновки данных на соответствие ограничениям, необходимым
// для ее использования при расчете цен
//
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, которую необходимо проверить.
//  СообщениеОбОшибке     - Строка - Строка, содержит вводную часть сообщения об ошибке.
//
// Возвращаемое значение:
//  Булево - Истина, если проверка пройдена успешно.
//
Функция ПроверитьСхемуКомпоновкиДанныхПоОбязательнымПолям(СхемаКомпоновкиДанных, Поля, СообщениеОбОшибке = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если СхемаКомпоновкиДанных <> Неопределено И СхемаКомпоновкиДанных.НаборыДанных.Количество() = 1 Тогда
		
		РабочийНаборДанных = СхемаКомпоновкиДанных.НаборыДанных[0];
		
		Для Каждого Поле Из Поля Цикл
			Если Не ПроверитьПолеНабораДанныхСКД(РабочийНаборДанных, Поле.Ключ, Поле.Значение, СообщениеОбОшибке) Тогда
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ЗначениеЗаполнено(СообщениеОбОшибке), СообщениеОбОшибке + ": ", "") 
			+ НСтр("ru='Схема компоновки данных для заполнения показателя должна содержать один набор данных.'"));
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// Проверяет набор данных СКД, что он содержит заданное поле соответствующего типа
//
// Параметры:
//  НаборДанных         - набор данных, который необходимо проверить
//  ИмяПоля             - Строка, содержащее имя поля
//  ТипЗначения         - ОписаниеТипов, тип который должно иметь поле СКД
//  СообщениеОбОшибке   - Строка, содержит вводную часть сообщения об ошибке
//
// Возвращаемое значение:
//  Булево - Истина, если набор данных содержит требуемое поле.
//
Функция ПроверитьПолеНабораДанныхСКД(НаборДанных, ИмяПоля, ТипЗначения, СообщениеОбОшибке = Неопределено)
	
	Поле = НаборДанных.Поля.Найти(ИмяПоля);
	
	Если Поле = Неопределено Тогда
		Результат = Ложь;
	Иначе
		ТипыПоля       = Поле.ТипЗначения.Типы();
		ДопустимыеТипы = ТипЗначения.Типы();
		
		Результат = Истина;
		Если Поле <> Неопределено И ТипыПоля.Количество() = ДопустимыеТипы.Количество() Тогда
			
			Для Каждого Тип Из ДопустимыеТипы Цикл
				Если ТипыПоля.Найти(Тип) = Неопределено Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ЗначениеЗаполнено(СообщениеОбОшибке), СообщениеОбОшибке + ": ", "") 
			+ СтрЗаменить(СтрЗаменить(НСтр("ru='Схема компоновки данных для заполнения показателя должна содержать поле ""%ИмяПоля%"" с типом значения ""%ТипЗначения%"".'"), "%ИмяПоля%", ИмяПоля), "%ТипЗначения%", ТипЗначения));
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
// Добавляет выбранное поле в группировку компоновки
//
Процедура ДобавитьВыбранноеПолеСКД(ГруппировкаКомпоновкиДанных, Поле) Экспорт
	
	ВыбранноеПоле               = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных(Поле);
	ВыбранноеПоле.Использование = Истина;
	
КонецПроцедуры

// Расчет показателя
Процедура РассчитатьПоказатель(ПараметрыРасчета) экспорт
	
	СхемаКомпоновкиДанных=ПараметрыРасчета.Показатель.ХранилищеСхемыКомпоновкиДанных.получить();	
	ВАлгоритмах=не ПараметрыРасчета.Показатель.НезависимоОтОбеспечения;
	
//	если ВАлгоритмах тогда
	// построение запроса
	СхемаКомпоновкиДанных.НаборыДанных[0].запрос=ПолучитьТоварыВАлгоритмеРасчета(ВАлгоритмах)+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"+СхемаКомпоновкиДанных.НаборыДанных[0].запрос;
//	конецесли;
	СхемаЗапроса= Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(СхемаКомпоновкиДанных.НаборыДанных[0].запрос);
	ПакетЗапроса=СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество()-1];
	
//	если ВАлгоритмах тогда
	УсловиеОператора="(&НоменклатураТаблицы&ХарактеристикаТаблицы&СкладТаблицы) в (Выбрать ВР_Товары.Номенклатура КАК Номенклатура&ВРХарактеристика&ВРСклад из ВР_Товары)";
	
	если ПакетЗапроса.колонки.найти("Номенклатура")<>НЕОПРЕДЕЛЕНО тогда
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&НоменклатураТаблицы",пакетЗапроса.Колонки.Найти("Номенклатура").Поля[0]);
	конецесли;	
	если ПакетЗапроса.колонки.найти("Характеристика")<>НЕОПРЕДЕЛЕНО тогда
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&ХарактеристикаТаблицы",", "+пакетЗапроса.Колонки.Найти("Характеристика").Поля[0]);
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&ВРХарактеристика",", ВР_Товары.Характеристика как Характеристика");
	иначе
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&ХарактеристикаТаблицы","");
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&ВРХарактеристика","");
	конецесли;
	если ПакетЗапроса.колонки.найти("Склад")<>НЕОПРЕДЕЛЕНО тогда
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&СкладТаблицы",", "+пакетЗапроса.Колонки.Найти("Склад").Поля[0]);	
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&ВРСклад",", ВР_Товары.Склад как Склад");	
	иначе
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&СкладТаблицы","");	
		УсловиеОператора=Стрзаменить(УсловиеОператора,"&ВРСклад","");	
	конецесли;
	
	ОператорЗапроса=ПакетЗапроса.Операторы[0];
	ОператорЗапроса.Отбор.Добавить(УсловиеОператора);
	//конецесли;
	СхемаКомпоновкиДанных.НаборыДанных[0].запрос=СхемаЗапроса.ПолучитьТекстЗапроса();
	// Компоновка макета и исполнение запроса.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиКомпоновкиДанных=ПараметрыРасчета.Показатель.ХранилищеНастроекКомпоновкиДанных.получить();	
	// Подготовка компоновщика макета компоновки данных, загрузка настроек
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	Если НастройкиКомпоновкиДанных <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	// Заполнение структуры отчета и выбранных полей.
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	ГруппировкаДетальныеЗаписи = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныеЗаписи.Использование = Истина;
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Номенклатура");
	если ПакетЗапроса.колонки.найти("Характеристика")<>НЕОПРЕДЕЛЕНО тогда
		ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Характеристика");
	КонецЕсли;
	если ПакетЗапроса.колонки.найти("Склад")<>НЕОПРЕДЕЛЕНО тогда
		ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Склад");
	КонецЕсли;
	если ПакетЗапроса.колонки.найти("ДопПараметрДата")<>НЕОПРЕДЕЛЕНО тогда
		ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "ДопПараметрДата");
	КонецЕсли;
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "РезультатЧисло");
	если ВАлгоритмах тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Показатель",ПараметрыРасчета.Показатель);
	КонецЕсли;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата",ТекущаяДата());
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДанныеОтчета = Новый ТаблицаЗначений();
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ДанныеОтчета = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// запись результата
	РегистрыСведений.оп_РезультатРасчетаПоказателей.ЗаписатьПоказателиРегистраТаблица(ДанныеОтчета,ПараметрыРасчета.Показатель);
	
КонецПроцедуры

Функция ПолучитьТоварыВАлгоритмеРасчета(валгоритме)
	
	ТекстПодЗапросаАлгоритм = 
		"ВЫБРАТЬ
		|	ТоварныеОграничения.Номенклатура КАК Номенклатура,
		|	ТоварныеОграничения.Характеристика КАК Характеристика,
		|	ТоварныеОграничения.Склад КАК Склад
		|ПОМЕСТИТЬ ВР_Товары
		|ИЗ
		|	Справочник.оп_АлгоритмыОбеспеченияПотребностей.Показатели КАК ВАлгоритмах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО ВАлгоритмах.Ссылка = ТоварныеОграничения.АлгоритмРасчета
		|ГДЕ
		|	ВАлгоритмах.Показатель = &Показатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпособыМетодыОбеспечения.Номенклатура,
		|	СпособыМетодыОбеспечения.Характеристика,
		|	СпособыМетодыОбеспечения.Склад
		|ИЗ
		|	Справочник.оп_АлгоритмыОбеспеченияПотребностей.Показатели КАК ВАлгоритмах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыМетодыОбеспечения КАК СпособыМетодыОбеспечения
		|		ПО ВАлгоритмах.Ссылка = СпособыМетодыОбеспечения.АлгоритмРасчета
		|ГДЕ
		|	ВАлгоритмах.Показатель = &Показатель";
	
	ТекстПодЗапроса = 
		"ВЫБРАТЬ
		|	СпособыМетодыОбеспечения.Номенклатура КАК Номенклатура,
		|	СпособыМетодыОбеспечения.Характеристика КАК Характеристика,
		|	СпособыМетодыОбеспечения.Склад КАК Склад
		|ПОМЕСТИТЬ ВР_Товары
		|ИЗ
		|	РегистрСведений.СпособыМетодыОбеспечения КАК СпособыМетодыОбеспечения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварныеОграничения.Номенклатура,
		|	ТоварныеОграничения.Характеристика,
		|	ТоварныеОграничения.Склад
		|ИЗ
		|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения";
	
	
	
	
	возврат ?(валгоритме,ТекстПодЗапросаАлгоритм,ТекстПодЗапроса);
КонецФункции // ПолучитьТаблицуТоваров()
